reservation2.xml


<?xml version="1.0" encoding="utf-8"?>
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
    <s:Header />
    <s:Body>
    <univ:AirCreateReservationReq xmlns:common_v41_0="http://www.travelport.com/schema/common_v41_0" xmlns:univ="http://www.travelport.com/schema/universal_v41_0" AuthorizedBy="user" RetainReservation="None" xmlns="http://www.travelport.com/schema/air_v41_0" TraceId="1982222261_1601282416" TargetBranch="P7106193">
        <BillingPointOfSaleInfo xmlns="http://www.travelport.com/schema/common_v41_0" OriginApplication="UAPI"></BillingPointOfSaleInfo>
        
<BookingTraveler xmlns="http://www.travelport.com/schema/common_v41_0" Key="0" TravelerType="ADT" DOB="1990-03-14" Gender="M">
    <BookingTravelerName Prefix="Mrs" First="Anitha" Last="Gangapatanm" />
    <PhoneNumber Number="8050584929" Type="Mobile" />
    <Email EmailID="anitha.g.provab@gmail.com" Type="P" />
    <Address>
        <AddressName>HIMANSHU</AddressName>
        <Street>TEST</Street>
        <City>TEST</City>
        <State>TEST</State>
        <PostalCode>560100</PostalCode>
        <Country>IN</Country>
    </Address>
</BookingTraveler>
        <FormOfPayment xmlns="http://www.travelport.com/schema/common_v41_0" Type="Cash"></FormOfPayment>
        <AirPricingSolution xmlns="http://www.travelport.com/schema/air_v41_0" Key="gDBGhT3R2BKAdjBmCAAAAA==" TotalPrice="INR15973" BasePrice="GBP22.00" ApproximateTotalPrice="INR15973" ApproximateBasePrice="INR2175" EquivalentBasePrice="INR2175" Taxes="INR13798" ApproximateTaxes="INR13798" QuoteDate="2020-10-06"><AirSegment Key="gDBGhT3R2BKAZjBmCAAAAA==" Group="0" Carrier="PC" FlightNumber="1182" ProviderCode="1G" Origin="STN" Destination="SAW" DepartureTime="2020-12-02T12:50:00.000+00:00" ArrivalTime="2020-12-02T19:30:00.000+03:00" FlightTime="220" TravelTime="220" Distance="1547" ClassOfService="Q" Equipment="321" ChangeOfPlane="false" OptionalServicesIndicator="false" ParticipantLevel="Secure Sell" AvailabilityDisplayType="Fare Specific Fare Quote Unbooked"><CodeshareInfo OperatingCarrier="PC" OperatingFlightNumber=""></CodeshareInfo><AirAvailInfo ProviderCode="1G"><BookingCodeInfo BookingCounts="9"></BookingCodeInfo></AirAvailInfo><FlightDetails Key="gDBGhT3R2BKAajBmCAAAAA==" Origin="STN" Destination="SAW" DepartureTime="2020-12-02T12:50:00.000+00:00" ArrivalTime="2020-12-02T19:30:00.000+03:00" FlightTime="220" TravelTime="220" Distance="1547"></FlightDetails></AirSegment><AirSegment Key="gDBGhT3R2BKAbjBmCAAAAA==" Group="0" Carrier="PC" FlightNumber="740" ProviderCode="1G" Origin="SAW" Destination="DXB" DepartureTime="2020-12-02T20:50:00.000+03:00" ArrivalTime="2020-12-03T02:15:00.000+04:00" FlightTime="265" TravelTime="265" Distance="1870" ClassOfService="Q" Equipment="321" ChangeOfPlane="false" OptionalServicesIndicator="false" ParticipantLevel="Secure Sell" AvailabilityDisplayType="Fare Specific Fare Quote Unbooked"><CodeshareInfo OperatingCarrier="PC" OperatingFlightNumber=""></CodeshareInfo><AirAvailInfo ProviderCode="1G"><BookingCodeInfo BookingCounts="9"></BookingCodeInfo></AirAvailInfo><FlightDetails Key="gDBGhT3R2BKAcjBmCAAAAA==" Origin="SAW" Destination="DXB" DepartureTime="2020-12-02T20:50:00.000+03:00" ArrivalTime="2020-12-03T02:15:00.000+04:00" FlightTime="265" TravelTime="265" Distance="1870"></FlightDetails></AirSegment><AirPricingInfo Key="gDBGhT3R2BKAfjBmCAAAAA==" TotalPrice="INR15973" BasePrice="GBP22.00" ApproximateTotalPrice="INR15973" ApproximateBasePrice="INR2175" EquivalentBasePrice="INR2175" ApproximateTaxes="INR13798" Taxes="INR13798" LatestTicketingTime="2020-10-06T23:59:00.000+05:30" PricingMethod="Guaranteed" IncludesVAT="false" ETicketability="Yes" PlatingCarrier="PC" ProviderCode="1G"><FareInfo Key="gDBGhT3R2BKAnjBmCAAAAA==" FareBasis="QOWBYD1W" PassengerTypeCode="ADT" Origin="STN" Destination="DXB" EffectiveDate="2020-10-06T20:45:00.000+05:30" DepartureDate="2020-12-02" Amount="INR2175" NotValidBefore="2020-12-02"><FareRuleKey FareInfoRef="gDBGhT3R2BKAnjBmCAAAAA==" ProviderCode="1G">6UUVoSldxwhZjXRtKiPFrcbKj3F8T9EyxsqPcXxP0TLGyo9xfE/RMsuWFfXVd1OAly5qxZ3qLwOXLmrFneovA5cuasWd6i8Dly5qxZ3qLwOXLmrFneovA7dLLuPUIhqZxWa1uaqI55k3aSkvhp2ybYbkpiAj4xlHarlX6CKVpyRN3J3NyYpz6RDKFFZ4V12PQFDb+712lFDsE8x1K6Z2+WLgFn3B9sPdSU8gecfbWEnMU535bvD9TJMscFUjz8UphAevkIpVdc3OXN0QSTGD1UPFc7ZmQhP+mpBH9wehGMENcAPBqbPCNkGFEpk5QESP/AFKEXb03hK/he9va7VDH7+F729rtUMfv4Xvb2u1Qx+/he9va7VDHxDGJun84l6GmjYuszn207WOnxkQ2WPPHvaVUAnec78/1inYl1JZ1xx5BqgrcyYJEtwXtO9a1rEPNomuuq4tJiU=</FareRuleKey></FareInfo><BookingInfo BookingCode="Q" CabinClass="Economy" FareInfoRef="gDBGhT3R2BKAnjBmCAAAAA==" SegmentRef="gDBGhT3R2BKAZjBmCAAAAA=="></BookingInfo><BookingInfo BookingCode="Q" CabinClass="Economy" FareInfoRef="gDBGhT3R2BKAnjBmCAAAAA==" SegmentRef="gDBGhT3R2BKAbjBmCAAAAA=="></BookingInfo><TaxInfo Category="GB" Amount="INR7895" Key="gDBGhT3R2BKAgjBmCAAAAA=="></TaxInfo><TaxInfo Category="UB" Amount="INR1347" Key="gDBGhT3R2BKAhjBmCAAAAA=="></TaxInfo><TaxInfo Category="M6" Amount="INR268" Key="gDBGhT3R2BKAijBmCAAAAA=="></TaxInfo><TaxInfo Category="TR" Amount="INR446" Key="gDBGhT3R2BKAjjBmCAAAAA=="></TaxInfo><TaxInfo Category="ZR" Amount="INR102" Key="gDBGhT3R2BKAkjBmCAAAAA=="></TaxInfo><TaxInfo Category="YQ" Amount="INR2244" Key="gDBGhT3R2BKAljBmCAAAAA=="></TaxInfo><TaxInfo Category="YR" Amount="INR1496" Key="gDBGhT3R2BKAmjBmCAAAAA=="></TaxInfo><PassengerType Code="ADT"></PassengerType><PassengerType Code="ADT"></PassengerType><ChangePenalty><Amount>INR3738.0</Amount></ChangePenalty><CancelPenalty><Percentage>100.00</Percentage></CancelPenalty><BaggageAllowances><BaggageAllowanceInfo TravelerType="ADT" Origin="STN" Destination="DXB" Carrier="PC"><URLInfo><URL>VIEWTRIP.TRAVELPORT.COM/BAGGAGEPOLICY/PC</URL></URLInfo><TextInfo></TextInfo><TextInfo></TextInfo><BagDetails ApplicableBags="1stChecked"><BaggageRestriction><TextInfo><Text>CHGS MAY APPLY IF BAGS EXCEED TTL WT ALLOWANCE</Text></TextInfo></BaggageRestriction></BagDetails><BagDetails ApplicableBags="2ndChecked"><BaggageRestriction><TextInfo><Text>CHGS MAY APPLY IF BAGS EXCEED TTL WT ALLOWANCE</Text></TextInfo></BaggageRestriction></BagDetails></BaggageAllowanceInfo><CarryOnAllowanceInfo Origin="STN" Destination="SAW" Carrier="PC"><TextInfo><Text></Text></TextInfo><CarryOnDetails ApplicableCarryOnBags="1"><BaggageRestriction><TextInfo><Text>CHGS MAY APPLY IF BAGS EXCEED TTL WT ALLOWANCE</Text></TextInfo></BaggageRestriction></CarryOnDetails><CarryOnDetails ApplicableCarryOnBags="2"><BaggageRestriction><TextInfo><Text>CHGS MAY APPLY IF BAGS EXCEED TTL WT ALLOWANCE</Text></TextInfo></BaggageRestriction></CarryOnDetails></CarryOnAllowanceInfo><CarryOnAllowanceInfo Origin="SAW" Destination="DXB" Carrier="PC"><TextInfo><Text></Text></TextInfo><CarryOnDetails ApplicableCarryOnBags="1"><BaggageRestriction><TextInfo><Text>CHGS MAY APPLY IF BAGS EXCEED TTL WT ALLOWANCE</Text></TextInfo></BaggageRestriction></CarryOnDetails><CarryOnDetails ApplicableCarryOnBags="2"><BaggageRestriction><TextInfo><Text>CHGS MAY APPLY IF BAGS EXCEED TTL WT ALLOWANCE</Text></TextInfo></BaggageRestriction></CarryOnDetails></CarryOnAllowanceInfo></BaggageAllowances></AirPricingInfo><FareNote Key="gDBGhT3R2BKArjBmCAAAAA==">SUM IDENTIFIED AS UB IS A PASSENGER SERVICE CHARGE</FareNote><FareNote Key="gDBGhT3R2BKAsjBmCAAAAA==">RATE USED IN EQU TOTAL IS BSR 1GBP - 98.679892INR</FareNote><FareNote Key="gDBGhT3R2BKAtjBmCAAAAA==">LAST DATE TO PURCHASE TICKET: 06OCT20 DEL</FareNote><FareNote Key="gDBGhT3R2BKAujBmCAAAAA==">TICKETING AGENCY 5Y9U</FareNote><FareNote Key="gDBGhT3R2BKAvjBmCAAAAA==">DEFAULT PLATING CARRIER PC</FareNote><FareNote Key="gDBGhT3R2BKAwjBmCAAAAA==">E-TKT REQUIRED</FareNote><FareNote Key="gDBGhT3R2BKAxjBmCAAAAA==">TICKETING FEES MAY APPLY</FareNote><HostToken Key="gDBGhT3R2BKAejBmCAAAAA==">GFB10101ADT00  01QOWBYD1W                              0200010002#GFB200010101NADTV3022PROM0020000399#GFMCSIP022NPROM PC ADTQOWBYD1W</HostToken></AirPricingSolution>
        <ActionStatus ProviderCode="1G" TicketDate="T*" Type="ACTIVE" QueueCategory="01" xmlns="http://www.travelport.com/schema/common_v41_0"></ActionStatus>
        <!--<SpecificSeatAssignment xmlns="http://www.travelport.com/schema/air_v41_0" SeatId="5C" BookingTravelerRef="0" SegmentRef="O5nb3SPc1BKAdGOUzCAAAA==" />-->
    </univ:AirCreateReservationReq>
    </s:Body>
</s:Envelope>